{
  "platforms": "windows10",
  "id": "06724df8-eac2-414d-9dae-ca53d5f8adbf",
  "technologies": "mdm",
  "settingCount": 1,
  "name": "Disable password reveal",
  "templateReference": {
    "templateDisplayVersion": null,
    "templateFamily": "none",
    "templateDisplayName": null,
    "templateId": ""
  },
  "roleScopeTagIds": [
    "0"
  ],
  "lastModifiedDateTime": "2024-04-24T15:01:51.3586705Z",
  "creationSource": null,
  "description": "Disables the password reveal button",
  "priorityMetaData": null,
  "createdDateTime": "2024-04-24T15:01:51.3586705Z",
  "settings": [
    {
      "id": "0",
      "settingInstance": {
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "user_vendor_msft_policy_config_credentialsui_disablepasswordreveal",
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "children": [],
          "value": "user_vendor_msft_policy_config_credentialsui_disablepasswordreveal_1"
        }
      }
    }
  ]
}
