{
  "platforms": "windows10",
  "id": "9abda465-de1f-4bfe-abcb-1adefd7230dd",
  "technologies": "mdm",
  "settingCount": 2,
  "name": "Enable Azure Information Protection add-in for sensitivity labeling",
  "templateReference": {
    "templateDisplayVersion": null,
    "templateFamily": "none",
    "templateDisplayName": null,
    "templateId": ""
  },
  "roleScopeTagIds": [
    "0"
  ],
  "lastModifiedDateTime": "2024-04-08T20:14:19.562314Z",
  "creationSource": null,
  "description": "Enables the policy that ensures Azure Information Protection add-in for\nsensitivity labeling is present",
  "priorityMetaData": null,
  "createdDateTime": "2024-04-08T20:14:19.562314Z",
  "settings": [
    {
      "id": "0",
      "settingInstance": {
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "user_vendor_msft_policy_config_office16v13~policy~l_microsoftofficesystem~l_securitysettings_l_aipexception",
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "children": [],
          "value": "user_vendor_msft_policy_config_office16v13~policy~l_microsoftofficesystem~l_securitysettings_l_aipexception_1"
        }
      }
    },
    {
      "id": "1",
      "settingInstance": {
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "user_vendor_msft_policy_config_office16v3~policy~l_microsoftofficesystem~l_securitysettings_l_useofficeforlabelling",
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "children": [],
          "value": "user_vendor_msft_policy_config_office16v3~policy~l_microsoftofficesystem~l_securitysettings_l_useofficeforlabelling_0"
        }
      }
    }
  ]
}
