{
  "signatureOutOfDate": false,
  "firmwareProtectionEnabled": false,
  "version": 1,
  "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
  "passwordRequired": false,
  "osMaximumVersion": null,
  "passwordMinimumLength": null,
  "deviceThreatProtectionEnabled": false,
  "rtpEnabled": false,
  "tpmRequired": false,
  "createdDateTime": "2024-03-22T16:05:29.3196176Z",
  "antiSpywareRequired": true,
  "passwordRequiredType": "deviceDefault",
  "id": "42545924-bd92-4283-b08e-c22ad539f127",
  "earlyLaunchAntiMalwareDriverEnabled": false,
  "storageRequireEncryption": false,
  "deviceCompliancePolicyScript": null,
  "displayName": "Windows 10/11 compliance policy",
  "wslDistributions": [],
  "defenderEnabled": false,
  "lastModifiedDateTime": "2024-03-22T16:05:29.3196176Z",
  "mobileOsMaximumVersion": null,
  "codeIntegrityEnabled": false,
  "configurationManagerComplianceRequired": false,
  "virtualizationBasedSecurityEnabled": false,
  "memoryIntegrityEnabled": false,
  "description": "Windows 10/11 compliance policy",
  "validOperatingSystemBuildRanges": [],
  "bitLockerEnabled": false,
  "passwordPreviousPasswordBlockCount": null,
  "secureBootEnabled": false,
  "osMinimumVersion": null,
  "passwordMinimumCharacterSetCount": null,
  "roleScopeTagIds": [
    "0"
  ],
  "requireHealthyDeviceReport": false,
  "mobileOsMinimumVersion": null,
  "passwordExpirationDays": null,
  "passwordMinutesOfInactivityBeforeLock": null,
  "passwordRequiredToUnlockFromIdle": false,
  "antivirusRequired": true,
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "passwordBlockSimple": false,
  "defenderVersion": null,
  "kernelDmaProtectionEnabled": false,
  "activeFirewallRequired": true
}
